---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InstanceFreeHostOffsetParam
source: html/057807a8-d57c-e8f5-3ce3-89af2975005a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InstanceFreeHostOffsetParam Property

"Offset from Host"

## Syntax (C#)
```csharp
public static ForgeTypeId InstanceFreeHostOffsetParam { get; }
```